server/app/graphql/mutations/sign_in.rb

    def resolve(email:, password:)
      user = User.find_by(email: email.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@cartify.dev"], ["LIMIT", 1]]