server/app/models/product.rb

  def create_default_variant
    variants.create!(title: 'Default', price: 0) if variants.empty?
---
INSERT INTO "variants" ("product_id", "title", "sku", "price", "compare_at_price", "position", "option_values", "requires_shipping", "weight", "weight_unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"