server/app/policies/application_policy.rb

SELECT "store_memberships".* FROM "store_memberships" WHERE "store_memberships"."user_id" = $1 AND "store_memberships"."store_id" = $2 LIMIT $3  [["user_id", "4a6a4aab-8b61-406b-ad22-57c64f19e3bf"], ["store_id", "aa9db840-4ede-4258-9ffc-1b3643463cda"], ["LIMIT", 1]]
---
  def membership
    @membership ||= user&.store_memberships&.find_by(store: store)