server/app/graphql/types/query_type.rb

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", "aa9db840-4ede-4258-9ffc-1b3643463cda"], ["LIMIT", 1]]
---
    def store(id:)
      store = Store.find_by(id: id)

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", "aa9db840-4ede-4258-9ffc-1b3643463cda"], ["LIMIT", 1]]
---
    def orders(store_id:, status: nil, search: nil)
      store = Store.find(store_id)

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", "aa9db840-4ede-4258-9ffc-1b3643463cda"], ["LIMIT", 1]]
---
    def low_stock_variants(store_id:, threshold: nil)
      store = Store.find(store_id)